j21/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Antonin"], ["password_digest", "$2a$10$6WV6yBQ2s2ooFmWL8irQJedWwWrBQaJy3ROVSVstCxkeZd4sBTAjW"], ["updated_at", "2018-02-05 15:10:13.623486"], ["id", 1]]